import os
import re
from errno import ENOENT as FILE_NOT_FOUND
import sys
from svglib.svglib import svg2rlg
from reportlab.graphics import renderPM

def ascii_filename(kanjiCharacter):

    try:
        code = '%05x' % ord(kanjiCharacter)
    except TypeError:  # character not a character
        code='error'
    return code 

source_directory = os.path.join('./kanji')


kanjiListN1=["仰","偽","傷","厳","嫁","嫌","弾","怠","懐","描","操","柄","染","滑","潜","焦","盛","結","臭","裁","覆","請","貴","跳","逝","基","志","悔","憂","我","棟","潤","狭","稲","端","絞","肥","脅","苗","謡","陥","隣","雄","雌","伏","修","凝","励","卑","及","哀","嘆","垂","壊","寂","就","尽","崩","廃","従","忌","忍","怪","恨","惜","愁","慰","憩","懲","懸","挙","振","授","揚","揺","携","擦","整","暖","架","殖","浸","添","渋","滅","漏","澄","濁","煩","煮","狂","狩","甚","疎","癒","砕","窮","納","紛","締","緩","縮","翻","脱","腐","膨","興","裂","踏","載","透","遣","鎮","陰","隔","隠","離","飽","駆","驚","丘","乏","亀","井","仮","企","伴","併","侍","価","侮","侵","促","保","俵","倉","倣","偏","健","傍","傘","催","償","充","免","兼","冒","冠","刀","刃","削","剣","創","劣","勧","升","吐","唆","唇","唱","善","喪","器","噴","執","培","堅","堤","堪","塊","墓","墨","壁","奉","奏","契","奪","奮","妨","姿","婿","宮","宵","射","尋","尼","尾","履","岳","峰","巡","巣","巧","己","帆","幹","幻","弓","弔","弦","張","彩","彫","影","応","恭","恵","悟","悼","惑","惨","愚","慈","慎","慕","憤","憧","懇","戒","戯","房","扇","扉","抑","拒","拙","拳","挑","挿","控","推","掲","提","握","搾","摘","撃","撮","攻","故","救","敵","敷","斜","施","旗","既","旨","暁","暇","暑","暦","朗","朽","松","柳","桃","桑","桜","梅","欺","殊","殴","殻","氏","汁","江","沖","沢","沼","沿","泡","泣","洞","津","浜","淡","渇","渦","湧","源","溝","滞","漂","漆","潔","潮","激","災","炊","炎","熟","爽","牧","狙","独","猿","獣","獲","率","琴","異","癖","盾","眉","眺","眼","瞬","瞳","矛","矢","矯","礎","秀","秘","稼","穂","穏","穴","窯","笛","筋","節","粋","粗","粘","糧","紡","紫","統","絹","継","綱","網","縁","縄","縛","縦","縫","織","繕","繭","羊","翼","耐","聴","肝","脚","臨","至","致","舌","艶","芳","芽","茂","茎","華","葬","蓄","薦","薪","薫","藍","藤","藻","虎","虐","蚕","蛇","蛍","街","衰","裸","褒","襟","襲","討","訳","訴","診","詔","詠","詳","誇","誉","誓","誘","誠","諭","諮","謀","謝","謹","譲","豆","豚","貢","貫","賄","賜","赴","趣","躍","輝","辱","迫","遂","遭","遮","避","酌","酔","酢","酸","醜","醸","釣","鈴","鉛","銭","鋳","鋼","錦","鍛","鎖","鏡","鐘","鑑","闘","阻","陵","障","雷","霊","霜","霧","露","響","顧","飢","飼","飾","養","騒","鬼","魂","鮮","鯨","鶏","麗","麻","黙","鼓","卸","据","漬","鹿","且","但","刈","又","唄","坪","垣","堀","塚","姫","岡","岬","峠","崎","嵐","弥","扱","杉","枠","株","梨","棚","浦","滝","潟","瀬","熊","畝","繰","芋","芝","虞","虹","蚊","鎌","駒","鶴","丁","仁","凡","功","博","吉","唯","壇","如","妄","宗","幕","拍","拠","旦","旬","模","泌","献","甲","疫","皇","益","素","罰","耗","虚","衆","遺","郷","鉢","丙","丹","乙","亜","享","亭","仙","伎","伐","伯","佐","佳","侯","俊","俗","俳","俸","倫","倹","偵","傑","債","僕","僚","僧","儀","儒","克","典","冗","冶","准","凶","凸","凹","刑","剖","剛","剤","剰","劾","勅","勘","勲","匠","匿","卓","即","却","厄","厘","叔","叙","句","司","后","吏","吟","呂","呈","呉","哲","啓","喚","喝","嗣","嘱","嚇","囚","圏","坑","堕","塀","塁","塑","塾","墜","墳","墾","壌","士","壮","壱","奇","奈","奔","奨","奴","妃","妊","妙","妥","姻","威","娠","娯","婆","媒","媛","嫡","嬢","孔","孝","孤","宙","宜","宣","宰","宴","密","寛","寡","寧","審","寮","寸","尉","尚","尺","尿","屈","展","属","屯","岐","峡","崇","帝","帥","帳","幣","幽","序","庶","康","庸","廉","廊","廷","弁","弊","弐","弧","彰","往","征","径","徐","循","微","徳","徴","徹","忠","恒","恩","悠","悦","惰","愉","態","慢","慨","慮","慶","憲","憶","憾","扶","批","抄","把","抗","択","披","抵","抹","抽","拐","拓","拘","拡","括","拷","掌","排","措","揮","援","搬","搭","摂","摩","撤","撲","擁","擬","敏","敢","斉","斎","斗","斤","斥","旋","旺","昆","昭","是","晶","暫","曹","朕","朱","朴","条","析","枢","某","栓","核","栽","案","桟","棄","棋","棺","椎","検","楼","概","槽","標","樹","欄","款","歓","殉","汰","汽","沙","没","泰","洪","派","浄","浪","涯","淑","渉","渓","滋","漠","漫","漸","濫","炉","為","烈","爵","牲","犠","猛","猟","猶","獄","玄","珠","班","瑠","璃","環","畔","疾","症","痘","痢","痴","盆","盟","監","盤","盲","看","睡","督","睦","瞭","砲","硝","硫","碁","碑","磁","礁","祉","祥","票","禅","禍","租","秩","称","稚","稿","穀","穫","窃","窒","竜","第","策","箇","範","篤","簿","粛","糖","系","糾","紀","紋","級","索","累","紳","紺","維","緊","緯","繁","繊","罷","羅","義","翁","聖","肖","肢","肪","肺","胆","胎","胞","胴","脈","腸","膜","舎","舗","舶","艇","艦","荘","菊","菌","藩","虜","蛮","融","衛","衝","衡","衷","裕","製","褐","覇","視","覧","訂","託","訟","証","詐","評","詩","該","誕","諾","謁","謄","謙","譜","護","豪","貞","賀","賃","賊","賓","賠","賦","購","赦","距","践","軌","軸","較","輩","轄","迅","迭","逐","逓","逮","逸","遇","遍","遵","遷","還","那","邦","邪","邸","郎","郡","郭","酪","酬","酵","酷","采","釈","銃","銘","錠","錬","錯","閑","閣","閥","閲","附","陛","陣","陪","陳","陶","隆","隊","随","隷","雅","雰","需","韻","項","須","頑","頒","頻","顕","餓","駄","騎","騰","髄","魅","魔"]
kanjiListN2=["並","丸","久","乱","乳","乾","了","介","仏","令","仲","伸","伺","低","依","個","倍","停","傾","像","億","兆","児","党","兵","冊","再","凍","刊","刷","券","刺","則","副","劇","効","勇","募","勢","包","匹","区","卒","協","占","印","卵","厚","双","叫","召","史","各","含","周","咲","喫","営","団","囲","固","圧","坂","均","型","埋","城","域","塔","塗","塩","境","央","奥","姓","委","季","孫","宇","宝","寺","封","専","将","尊","導","届","層","岩","岸","島","州","巨","巻","布","希","帯","帽","幅","干","幼","庁","床","底","府","庫","延","弱","律","復","快","恋","患","悩","憎","戸","承","技","担","拝","拾","挟","捜","捨","掃","掘","採","接","換","損","改","敬","旧","昇","星","普","暴","曇","替","札","机","材","村","板","林","枚","枝","枯","柔","柱","査","栄","根","械","棒","森","植","極","橋","欧","武","歴","殿","毒","比","毛","氷","永","汗","汚","池","沈","河","沸","油","況","泉","泊","波","泥","浅","浴","涙","液","涼","混","清","減","温","測","湖","湯","湾","湿","準","溶","滴","漁","濃","濯","灯","灰","炭","無","焼","照","燃","燥","爆","片","版","玉","珍","瓶","甘","畜","略","畳","療","皮","皿","省","県","短","砂","硬","磨","祈","祝","祭","禁","秒","移","税","章","童","競","竹","符","筆","筒","算","管","築","簡","籍","粉","粒","糸","紅","純","細","紹","絡","綿","総","緑","線","編","練","績","缶","署","群","羽","翌","耕","肌","肩","肯","胃","胸","脂","脳","腕","腰","膚","臓","臣","舟","航","般","芸","荒","荷","菓","菜","著","蒸","蔵","薄","虫","血","衣","袋","被","装","裏","補","複","角","触","訓","設","詞","詰","誌","課","諸","講","谷","豊","象","貝","貨","販","貯","貿","賞","賢","贈","超","跡","踊","軍","軒","軟","軽","輪","輸","辛","農","辺","述","逆","造","郊","郵","量","針","鈍","鉄","鉱","銅","鋭","録","門","防","陸","隅","階","隻","雇","雲","零","震","革","順","預","領","額","香","駐","骨","麦","黄","鼻","齢"]
kanjiListN3=["与","両","乗","予","争","互","亡","交","他","付","件","任","伝","似","位","余","例","供","便","係","信","倒","候","値","偉","側","偶","備","働","優","光","全","共","具","内","冷","処","列","初","判","利","到","制","刻","割","加","助","努","労","務","勝","勤","化","単","危","原","参","反","収","取","受","可","号","合","向","君","否","吸","吹","告","呼","命","和","商","喜","回","因","困","園","在","報","増","声","変","夢","太","夫","失","好","妻","娘","婚","婦","存","宅","守","完","官","定","実","客","害","容","宿","寄","富","寒","寝","察","対","局","居","差","市","師","席","常","平","幸","幾","座","庭","式","引","当","形","役","彼","徒","得","御","必","忘","忙","念","怒","怖","性","恐","恥","息","悲","情","想","愛","感","慣","成","戦","戻","所","才","打","払","投","折","抜","抱","押","招","指","捕","掛","探","支","放","政","敗","散","数","断","易","昔","昨","晩","景","晴","暗","暮","曲","更","最","望","期","未","末","束","杯","果","格","構","様","権","横","機","欠","次","欲","歯","歳","残","段","殺","民","求","決","治","法","泳","洗","活","流","浮","消","深","済","渡","港","満","演","点","然","煙","熱","犯","状","猫","王","現","球","産","由","申","留","番","疑","疲","痛","登","皆","盗","直","相","眠","石","破","確","示","礼","祖","神","福","科","程","種","積","突","窓","笑","等","箱","米","精","約","組","経","給","絵","絶","続","緒","罪","置","美","老","耳","職","育","背","能","腹","舞","船","良","若","苦","草","落","葉","薬","術","表","要","規","覚","観","解","記","訪","許","認","誤","説","調","談","論","識","警","議","負","財","貧","責","費","資","賛","越","路","身","辞","込","迎","返","迷","追","退","逃","途","速","連","進","遅","遊","過","達","違","遠","適","選","部","都","配","酒","閉","関","阪","降","限","除","険","陽","際","雑","難","雪","静","非","面","靴","頂","頭","頼","顔","願","類","飛","首","馬","髪","鳴"]
kanjiListN4=["不","世","主","事","京","仕","代","以","会","住","体","作","使","借","元","兄","公","写","冬","切","別","力","勉","動","医","去","口","古","台","同","味","品","員","問","図","地","堂","場","売","夏","夕","多","夜","妹","姉","始","字","安","室","家","少","屋","工","帰","広","店","度","建","弟","強","待","心","思","急","悪","意","手","持","教","文","料","新","方","旅","族","早","明","映","春","昼","曜","有","服","朝","業","楽","歌","止","正","歩","死","注","洋","海","漢","牛","物","特","犬","理","用","田","町","画","界","病","発","的","目","真","着","知","研","社","私","秋","究","空","立","答","紙","終","習","考","者","肉","自","色","花","英","茶","親","言","計","試","買","貸","質","赤","走","起","足","転","近","送","通","週","運","道","重","野","銀","開","院","集","青","音","題","風","飯","飲","館","駅","験","魚","鳥","黒"]
kanjiListN5=["一","二","三","四","五","六","七","八","九","十","百","千","万","上","下","中","前","後","北","南","東","西","右","左","木","山","川","日","月","火","水","本","金","土","友","人","入","円","今","先","来","毎","時","年","大","小","休","何","校","母","父","女","男","子","学","生","白","書","気","話","語","読","見","車","長","聞","行","間","雨","電","食","高","午","半","出","分","名","国","外","天"]
kanjiCharacters=kanjiListN1

for kanjiCharacter in kanjiCharacters:
    print(kanjiCharacter)
    ascii_char=ascii_filename(kanjiCharacter)
    fileName='kanji/'+ascii_char+ '.svg'

    #read svg content and change the font size
    f = open(fileName, "r",encoding='utf-8')
    svgContent=f.read()
    f.close()

    # print(svgContent)
    svgBigFont=svgContent.replace('style="font-size:8;fill:#808080"','style="font-size:0;fill:#000000"')
    # print(svgBigFont)

    #write new svg to new directory
    fileNameBigFont='toPNG/'+ascii_char+ '.svg'
    f2=open(fileNameBigFont, 'w', encoding='utf-8')
    f2.write(svgBigFont)
    f2.close()

    #use new file to make png
    pngDrawing = svg2rlg(fileNameBigFont)
    renderPM.drawToFile(pngDrawing, 'toPNG/'+ascii_char+'.png', fmt='PNG',dpi=150)

    #delete svg file as it is not necessary
    os.remove(fileNameBigFont)

